Embedded-MSH/STM32F407_Dev/src/usart.c

#include "usart.h"

#include <stdarg.h>
#include <stdint.h>
#include <stdio.h>
#include <stm32f4xx_hal.h>
#include <string.h>

UART_HandleTypeDef huart1;

//////////////////////////////////////////////////////////////   USART-1
/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************
 * 函  数： vUSART1_Init
 * 功  能： 初始化USART1的GPIO、通信参数配置、中断优先级
 *          (8位数据、无校验、1个停止位)
 * 参  数： uint32_t baudrate  通信波特率
 * 返回值： 无
 ******************************************************************************/
uint8_t USART1_ALREADY_INIT = 0;
void USART1_Init(uint32_t baudrate)
{
    /* USER CODE BEGIN USART1_Init 0 */

    /* USER CODE END USART1_Init 0 */

    /* USER CODE BEGIN USART1_Init 1 */

    /* USER CODE END USART1_Init 1 */
    huart1.Instance = USART1;
    huart1.Init.BaudRate = baudrate;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart1) != HAL_OK) {
        Error_Handler();
    }
    USART1_ALREADY_INIT = 1;
    /* USER CODE BEGIN USART1_Init 2 */

    /* USER CODE END USART1_Init 2 */

    printf("\r\r\r=========== STM32F407 外设初始报告 ===========\r");
    printf("USART1初始化配置         接收中断、空闲中断, 发送中断\r");
}


void HAL_UART_MspInit(UART_HandleTypeDef* uartHandle)
{

    GPIO_InitTypeDef GPIO_InitStruct = { 0 };
    if (uartHandle->Instance == USART1) {
        /* USER CODE BEGIN USART1_MspInit 0 */

        /* USER CODE END USART1_MspInit 0 */
        /* USART1 clock enable */
        __HAL_RCC_USART1_CLK_ENABLE();

        __HAL_RCC_GPIOA_CLK_ENABLE();
        /**USART1 GPIO Configuration
        PA9     ------> USART1_TX
        PA10     ------> USART1_RX
        */
        GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        /* USART1 interrupt Init */
        HAL_NVIC_SetPriority(USART1_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(USART1_IRQn);
        /* USER CODE BEGIN USART1_MspInit 1 */

        /* USER CODE END USART1_MspInit 1 */
    }
}

void HAL_UART_MspDeInit(UART_HandleTypeDef* uartHandle)
{

    if (uartHandle->Instance == USART1) {
        /* USER CODE BEGIN USART1_MspDeInit 0 */

        /* USER CODE END USART1_MspDeInit 0 */
        /* Peripheral clock disable */
        __HAL_RCC_USART1_CLK_DISABLE();

        /**USART1 GPIO Configuration
        PA9     ------> USART1_TX
        PA10     ------> USART1_RX
        */
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_9 | GPIO_PIN_10);

        /* USART1 interrupt Deinit */
        HAL_NVIC_DisableIRQ(USART1_IRQn);
        /* USER CODE BEGIN USART1_MspDeInit 1 */

        /* USER CODE END USART1_MspDeInit 1 */
    }
}

void USART1_IRQHandler(void)
{
    HAL_UART_IRQHandler(&huart1);
}

void USART1_SendData(uint8_t* buf, uint16_t cnt)
{
    HAL_UART_Transmit(&huart1, buf, cnt, 0xffff);
}

/******************************************************************************
 * 函  数： vUSART1_SendString
 * 功  能： UART通过中断发送输出字符串,无需输入数据长度
 *         【适合场景】字符串，长度<=256字节
 *         【不 适 合】int,float等数据类型
 * 参  数： char* stringTemp   需发送数据的缓存首地址
 * 返回值： 元
 ******************************************************************************/
void USART1_SendString(char* stringTemp)
{
    uint16_t num = 0;       // 字符串长度
    char* t = stringTemp;   // 用于配合计算发送的数量
    while (*t++ != 0)
        num++;   // 计算要发送的数目，这步比较耗时，测试发现每多6个字节，增加1us，单位：8位

    USART1_SendData((uint8_t*)stringTemp,
                    num);   // 注意调用函数所需要的真实数据长度;
}

// 用于 mock 掉 printf 函数
int printf_hook(const char* format, ...)
{
    if (USART1_ALREADY_INIT == 0) {
        return -1;
    }
    va_list args;
    va_start(args, format);
    char buffer[256];
    int n = vsnprintf(buffer, sizeof(buffer), format, args);
    USART1_SendString(buffer);
    va_end(args);
    return n;
}

#if 0
//////////////////////////////////////////////////////////////   USART-2
/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************
 * 函  数： vUSART2_Init
 * 功  能： 初始化USART的GPIO、通信参数配置、中断优先级
 *          (8位数据、无校验、1个停止位)
 * 参  数： uint32_t baudrate  通信波特率
 * 返回值： 无
 ******************************************************************************/
void USART2_Init(uint32_t baudrate)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    USART_InitTypeDef USART_InitStructure;

    // 时钟使能
    RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

    // 配置TX_PA2
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;      // 引脚编号：TX_PA2
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;   // 引脚方向: 复用功能
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      // 输出模式：推挽
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        // 上下拉：上拉
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;   // 输出速度：50MHz
    GPIO_Init(GPIOA,
              &GPIO_InitStructure);   // 初始化：把上述参数，更新到芯片寄存器
    // 配置RX_PA3
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;   // 引脚编号：RX_PA3
    GPIO_Init(GPIOA,
              &GPIO_InitStructure);   // 初始化：把上述参数，更新到芯片寄存器

    // 配置引脚的具体复用功能
    GPIO_PinAFConfig(GPIOA,
                     GPIO_PinSource2,
                     GPIO_AF_USART2);   // 配置引脚复用功能：USART2
    GPIO_PinAFConfig(GPIOA,
                     GPIO_PinSource3,
                     GPIO_AF_USART2);   // 配置引脚复用功能：USART2

    // NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    // 中断配置
    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;   // 抢占优先级
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;          // 子优先级
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;   // IRQ通道使能
    NVIC_Init(&NVIC_InitStructure);

    // USART 初始化设置
    // USART_DeInit(USART2);
    USART_InitStructure.USART_BaudRate = baudrate;   // 串口波特率
    USART_InitStructure.USART_WordLength =
        USART_WordLength_8b;   // 字长为8位数据格式
    USART_InitStructure.USART_StopBits = USART_StopBits_1;   // 一个停止位
    USART_InitStructure.USART_Parity = USART_Parity_No;   // 无奇偶校验位
    USART_InitStructure.USART_HardwareFlowControl =
        USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode =
        USART_Mode_Rx | USART_Mode_Tx;          // 使能收、发模式
    USART_Init(USART2, &USART_InitStructure);   // 初始化串口

    USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);   // 使能接受中断
    USART_ITConfig(USART2, USART_IT_IDLE, ENABLE);   // 使能空闲中断

    USART_Cmd(USART2, ENABLE);   // 使能串口, 开始工作

    USART2->SR = ~(0x00F0);   // 清理中断

