Embedded-MSH/STM32F407_Dev/src/usart.c
    USART_Cmd(USART6, ENABLE);   // 使能串口, 开始工作

    USART6->SR = ~(0x00F0);   // 清理中断

    xUSART6.InitFlag = 1;      // 标记初始化标志
    xUSART6.ReceivedNum = 0;   // 接收字节数清零

    printf("USART6初始化配置         接收中断、空闲中断, 发送中断\r");
}

/******************************************************************************
 * 函  数： USART6_IRQHandler
 * 功  能： USART1的接收中断、空闲中断、发送中断
 * 参  数： 无
 * 返回值： 无
 *
 ******************************************************************************/
static uint8_t usart6TxBuffer[256];   // 用于中断发送：环形缓冲区，256个字节
static uint8_t usart6TxCounter = 0;   // 用于中断发送：标记已发送的字节数(环形)
static uint8_t usart6TxCount = 0;   // 用于中断发送：标记将要发送的字节数(环形)

void USART6_IRQHandler(void)
{
    static uint16_t cnt = 0;   // 接收字节数累计：每一帧数据已接收到的字节数
    static uint8_t RxTemp
        [USART6_RX_BUF_SIZE];   // 接收数据缓存数组：每新接收１个字节，先顺序存放到这里，当一帧接收完(发生空闲中断),
                                // 再转存到全局变量：xUSART.USARTxReceivedData[xx]中；

    // 接收中断
    if (USART6->SR & (1 << 5))   // 检查RXNE(读数据寄存器非空标志位);
                                 // RXNE中断清理方法：读DR时自动清理；
    {
        if ((cnt
             >= USART6_RX_BUF_SIZE))   //||(xUSART1.ReceivedFlag==1 // 判断1:
                                       // 当前帧已接收到的数据量，已满(缓存区),
                                       // 为避免溢出，本包后面接收到的数据直接舍弃．
        {
            // 判断2:
            // 如果之前接收好的数据包还没处理，就放弃新数据，即，新数据帧不能覆盖旧数据帧，直至旧数据帧被处理．缺点：数据传输过快于处理速度时会掉包；好处：机制清晰，易于调试
            USART6
                ->DR;   // 读取数据寄存器的数据，但不保存．主要作用：读DR时自动清理接收中断标志；
            return;
        }
        RxTemp[cnt++] =
            USART6
                ->DR;   // 把新收到的字节数据，顺序存放到RXTemp数组中；注意：读取DR时自动清零中断位；
    }

    // 空闲中断, 用于配合接收中断，以判断一帧数据的接收完成
    if (USART6->SR & (1 << 4))   // 检查IDLE(空闲中断标志位);
                                 // IDLE中断标志清理方法：序列清零，USART1 ->SR;
                                 // USART1 ->DR;
    {
        xUSART6.ReceivedNum = 0;   // 把接收到的数据字节数清0
        memcpy(
            xUSART6.ReceivedData,
            RxTemp,
            USART6_RX_BUF_SIZE);   // 把本帧接收到的数据，存放到全局变量xUSART.USARTxReceivedData中,
                                   // 等待处理;
                                   // 注意：复制的是整个数组，包括0值，以方便字符串数据
        xUSART6.ReceivedNum =
            cnt;   // 把接收到的字节数，存放到全局变量xUSART.USARTxReceivedCNT中；
        cnt = 0;   // 接收字节数累计器，清零; 准备下一次的接收
        memset(
            RxTemp,
            0,
            USART6_RX_BUF_SIZE);   // 接收数据缓存数组，清零; 准备下一次的接收
        USART6->SR;
        USART6->DR;   // 清零IDLE中断标志位!! 序列清零，顺序不能错!!
    }

    // 发送中断
    if ((USART6->SR & 1 << 7)
        && (USART6->CR1
            & 1 << 7))   // 检查TXE(发送数据寄存器空)、TXEIE(发送缓冲区空中断使能)
    {
        USART6->DR = usart6TxBuffer
            [usart6TxCounter++];   // 读取数据寄存器值；注意：读取DR时自动清零中断位；
        if (usart6TxCounter == usart6TxCount)
            USART6->CR1 &=
                ~(1 << 7);   // 已发送完成，关闭发送缓冲区空置中断 TXEIE
    }
}


/******************************************************************************
 * 函  数： vUSART6_SendData
 * 功  能： UART通过中断发送数据,适合各种数据类型
 *         【适合场景】本函数可发送各种数据，而不限于字符串，如int,char
 *         【不 适 合】注意环形缓冲区容量256字节，如果发送频率太高，注意波特率
 * 参  数： uint8_t* buffer   需发送数据的首地址
 *          uint8_t  cnt      发送的字节数
 *，限于中断发送的缓存区大小，不能大于256个字节 返回值：
 ******************************************************************************/
void USART6_SendData(uint8_t* buf, uint16_t cnt)
{
    if (cnt > 256)
        cnt = 256;   // 本函数只适用于最大发送256个字节;
                     // 如果超过最大发送量，请自行分包发送，或者重写本函数

    for (uint16_t i = 0; i < cnt; i++)
        usart6TxBuffer[usart6TxCount++] = buf[i];

    if ((USART6->CR1 & 1 << 7)
        == 0)   // 检查发送缓冲区空置中断(TXEIE)是否已打开
        USART6->CR1 |= 1 << 7;
}

/******************************************************************************
 * 函  数： vUSART6_SendString
 * 功  能： UART通过中断发送输出字符串,无需输入数据长度
 *         【适合场景】字符串，长度<=256字节
 *         【不 适 合】int,float等数据类型
 * 参  数： char* stringTemp   需发送数据的缓存首地址
 * 返回值： 元
 ******************************************************************************/
void USART6_SendString(char* stringTemp)
{
    u16 num = 0;            // 字符串长度
    char* t = stringTemp;   // 用于配合计算发送的数量
    while (*t++ != 0)
        num++;   // 计算要发送的数目，这步比较耗时，测试发现每多6个字节，增加1us，单位：8位

    USART6_SendData((u8*)stringTemp,
                    num);   // 注意调用函数所需要的真实数据长度;
}


#endif
//////////////////////////////////////////////////////////////  printf
/////////////////////////////////////////////////////////////////
/******************************************************************************
 * 功  能： printf函数支持代码
 *         【特别注意】加入以下代码, 使用printf函数时, 不再需要选择use MicroLIB
 * 参  数：
 * 返回值：
 * 备  注： 最后修改_2020年07月15日
 ******************************************************************************/
// 加入以下代码,支持printf函数,而不需要选择use MicroLIB
#pragma import(__use_no_semihosting)
struct __FILE
{
    int handle;
};               // 标准库需要的支持函数
FILE __stdout;   // FILE 在stdio.h文件
void _sys_exit(int x)
{
    x = x;   // 定义_sys_exit()以避免使用半主机模式
}

int fputc(int ch,
          FILE* f)   // 重定向fputc函数，使printf的输出，由fputc输出到UART,
                     // 这里使用串口1(USART1)
{
    HAL_UART_Transmit(&huart1, (uint8_t*)&ch, sizeof(ch), 5);
    return ch;
}
